Revit 2026 API

# ModelPathUtils Class

---

Utility functions using ModelPaths

SystemObject Autodesk.Revit.DBModelPathUtils

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public static class ModelPathUtils
```
```vb
Public NotInheritable Class ModelPathUtils
```
```cpp
public ref class ModelPathUtils abstract sealed
```
```fsharp
[<AbstractClassAttribute>]
[<SealedAttribute>]
type ModelPathUtils = class end
```

The ModelPathUtils type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | CloudRegionEMEA | The name of cloud region EMEA. |
|  | CloudRegionUS | The name of cloud region US. |

|  | Name | Description |
| --- | --- | --- |
|  | ConvertCloudGUIDsToCloudPath | Converts a pair of cloud project and model GUIDs to a valid cloud path. |
|  | ConvertModelPathToUserVisiblePath | Gets a string version of the path of a given ModelPath. |
|  | ConvertUserVisiblePathToModelPath | Converts a user-visible path (string) to a ModelPath. |
|  | IsValidUserVisibleFullServerPath | Determines whether the given string represents a valid server path. |

#### Reference

Autodesk.Revit.DB Namespace